/*!
@file Scene.h
@brief シーン
*/
#pragma once

#include "stdafx.h"

namespace basecross {

	//--------------------------------------------------------------------------------------
	///	ゲームシーン
	//--------------------------------------------------------------------------------------
	class Scene : public SceneBase {

		void CreateResourses();

		//現在セレクトされているステージナンバー
		int m_StageNum;
	public:
		//--------------------------------------------------------------------------------------
		/*!
		@brief コンストラクタ
		*/
		//--------------------------------------------------------------------------------------
		
		float m_volumeBGM;
		float m_volumeLevelBGM;

		float m_volumeSE;
		float m_volumeLevelSE;

		//Pauseの処理
		Scene() :
			SceneBase(),
			m_volumeBGM(0.50f),
			m_volumeLevelBGM(0.0f),
			m_volumeSE(0.50f),
			m_volumeLevelSE(0.0f)

		{}


		//ステージナンバーのアクセサ
		int GetStageNum() const
		{
			return m_StageNum;
		}

		void SetStageNum(int i)
		{
			m_StageNum = i;
		}

		//--------------------------------------------------------------------------------------
		/*!
		@brief デストラクタ
		*/
		//--------------------------------------------------------------------------------------
		virtual ~Scene();
		//--------------------------------------------------------------------------------------
		/*!
		@brief 初期化
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnCreate() override;
		//--------------------------------------------------------------------------------------
		/*!
		@brief イベント取得
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnEvent(const shared_ptr<Event>& event) override;


	};

}

//end basecross
